In [1]:
import numpy as np
import pandas as pd

In [ ]:
1 - Creation Of DataFrame

In [6]:
data = {
    "Name": ["John", "Petter", "Lisa"],
    "Age": [25, 32, 33],
    "Salary": [30000, 25000, 24000]
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Salary
0    John   25   30000
1  Petter   32   25000
2    Lisa   33   24000

In [8]:
#Load CSV file
df = pd.read_csv("company.csv")

# Print the DataFrame
print(df)

   Unnamed: 0      Name gender  salary
0           0    ayushi      F   20000
1           1     rohit      M   25000
2           2  pranjali      F   27000

In [10]:
#Load Excel file
df = pd.read_excel("expense3.xlsx")

# Print the DataFrame
print(df)

         Date    Category       Sub-Category   Amount Payment Mode
0  2023-01-01     Grocery             Grocery      30         Cash
1  2023-01-02        Food          Restaurant     890          UPI
2  2023-01-04         123              Zomato     257          NaN
3  2023-01-06  Essentials               Diary     120          UPI
4  2023-01-06  Essentials             Perfume    1500         Cash
5  2023-01-09     Grocery  Fruits and Veggies     456         Cash
6  2023-01-10       Bills          House Rent   16000          UPI
7  2023-01-10     Grocery      Tomato KetchUp      70          UPI
8  2023-01-12        Food                Chai      15          UPI
9  2023-01-15  Essentials      Salt and Sugar      50          NaN
10 2023-01-17     Grocery           Chocolate     100          UPI
11 2023-01-17        Food          Restaurant     780         Card
12 2023-01-18  Essentials            Food Oil     120          NaN
13 2023-01-18        Food              Zomato     230          UPI
14 2023-01-19     Grocery                Milk      26          UPI
15 2023-01-20  Essentials             Shampoo     780          UPI
16 2023-01-20  Essentials           Lunch Box     890         Cash
17 2023-01-21     Clothes               Dress    1000          NaN
18 2023-01-22     Clothes               Dress    1890          UPI
19 2023-01-23     Grocery      Bread and Milk      56         Cash
20 2023-01-24        Food  Fruits and Veggies     530         Cash
21 2023-01-26        Food                Chai      10          UPI
22 2023-01-26     Grocery               Maggi     140          UPI
23 2023-01-27        Food              Zomato     300          UPI
24 2023-01-27        Food                Chai      10          UPI
25 2023-01-28  Essentials           Bedsheets    1025         Cash
26 2023-01-29       Bills             Mobile     1650          UPI
27 2023-01-29     Grocery                Daal     150         Cash
28 2023-01-30       Bills            Cylinder    1074          UPI

2-Exploring Data in Pandas

In [8]:
data = pd.read_excel("ESD.xlsx")
print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [9]:
data.head()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-04-08,141604,0.15,United States,Seattle,2021-10-16
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,1997-11-29,99975,0.00,China,Chongqing,NaT
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,2006-10-26,163099,0.20,United States,Chicago,NaT
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,2019-09-27,84913,0.07,United States,Chicago,NaT
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,1995-11-20,95409,0.00,United States,Phoenix,NaT

In [10]:
data.tail()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
995,E03094,Wesley Young,Sr. Analyst,Marketing,Speciality Products,Male,Caucasian,33,2016-09-18,98427,0.00,United States,Columbus,NaT
996,E01909,Lillian Khan,Analyst,Finance,Speciality Products,Female,Asian,44,2010-05-31,47387,0.00,China,Chengdu,2018-01-08
997,E04398,Oliver Yang,Director,Marketing,Speciality Products,Male,Asian,31,2019-06-10,176710,0.15,United States,Miami,NaT
998,E02521,Lily Nguyen,Sr. Analyst,Finance,Speciality Products,Female,Asian,33,2012-01-28,95960,0.00,China,Chengdu,NaT
999,E03545,Sofia Cheng,Vice President,Accounting,Corporate,Female,Asian,63,2020-07-26,216195,0.31,United States,Miami,NaT

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB

In [13]:
data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [18]:
#find Null Values
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

3-Dealing With Duplicate Values in Data set.

In [2]:
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [3]:
#find Duplicate data
print(data.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
#Row wise Duplicate values
print(data["EEID"].duplicated().sum())

2

In [7]:
#Drop duplicate values on column ,
#note if you delete row then use primary column.

print(data.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

4-Working  With Missing Data in Pandas.

In [2]:
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [4]:
data.isnull().sum()

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [6]:
#Replace all null values
print(data.replace(np.nan,0000))

    EEID      Name gender   salary
0  EMP01    ayushi      F      0.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      0  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05         0      M  25000.0
5  EMP06     rohit      M      0.0
6  EMP02     rohit      M  25000.0

In [7]:
#replace column wise null values
data["salary"] = data["salary"].replace(np.nan, 0000)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      0.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      0.0
6  EMP02     rohit      M  25000.0

4.2:Mean Values in data

In [9]:
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [10]:
print(data["salary"].mean())

24400.0

In [11]:
#replace column wise null values
data["salary"] = data["salary"].replace(np.nan, 24400.0)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

4.3:Forword fill backword fill for gender column.

In [12]:
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [14]:
#Backword fill
print(data.fillna(method = "bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\fkuwa\AppData\Local\Temp\ipykernel_9488\2754045057.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

In [15]:
#forward fill
print(data.fillna(method = "ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\fkuwa\AppData\Local\Temp\ipykernel_9488\1288348595.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

5-Column Transformation in Pandas Part-1.

In [9]:
#Condition Applying on Column.
df = pd.read_excel("ESD.xlsx")
print(data)

df.loc[(df["Bonus %"] == 0), "GetBonus"] = "no Bonus"
df.loc[(df["Bonus %"] > 0, "GetBonus")] = "bonus"
print(df.head(10))

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]
     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date  GetBonus
0     0.15  United States    Seattle 2021-10-16     bonus
1     0.00          China  Chongqing        NaT  no Bonus
2     0.20  United States    Chicago        NaT     bonus
3     0.07  United States    Chicago        NaT     bonus
4     0.00  United States    Phoenix        NaT  no Bonus
5     0.00          China  Chongqing        NaT  no Bonus
6     0.10  United States    Phoenix        NaT     bonus
7     0.00  United States      Miami 2021-05-20  no Bonus
8     0.06  United States     Austin        NaT     bonus
9     0.00  United States    Chicago        NaT  no Bonus

In [14]:
#Concatinate Column
data = pd.read_csv("company1.csv")
#print(data)
data['Name_Gender'] = data['Name'].str.upper() + " " + data['gender']
print(data)

    EEID      Name gender   salary Name_Gender
0  EMP01    ayushi      F      NaN    AYUSHI F
1  EMP02     rohit      M  25000.0     ROHIT M
2  EMP03  pranjali    NaN  27000.0         NaN
3  EMP01    ayushi      F  20000.0    AYUSHI F
4  EMP05       NaN      M  25000.0         NaN
5  EMP06     rohit      M      NaN     ROHIT M
6  EMP02     rohit      M  25000.0     ROHIT M

5.2-Column Transformation in Pandas Part-2.

data = pd.read_csv("company1.csv")
#print(data)

#Bonus calculate
data['Bonus'] = (data['salary']/100) * 20
print(data)

In [8]:
# String Short Value extract.
data = {"Month": ["January", "February", "March", "April"]}
a = pd.DataFrame(data)
#print(a)

def extract(value):
    return value[0:3]

a["Short_Month"] = a["Month"].map(extract)
print(a)

      Month Short_Month
0   January         Jan
1  February         Feb
2     March         Mar
3     April         Apr

6-Python PandasGroup by

In [3]:
data = pd.read_excel("ESD.xlsx")
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [4]:
#Group by function on gender
gp = data.groupby("Department").agg({"Gender":"count"})
print(gp)

                 Gender
Department
Accounting           96
Engineering         158
Finance             120
Human Resources     125
IT                  241
Marketing           120
Sales               140

In [5]:
gp = data.groupby(["Department","Gender"]).agg({"EEID":"count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [8]:
gp = data.groupby("Country").agg({"Annual Salary":"mean"})
print(gp)

               Annual Salary
Country
Brazil         112324.834532
China          113823.532110
United States  113204.794712

In [11]:
gp = data.groupby(["Country", "Gender"]).agg({"Annual Salary":"max","Age":"min"})
print(gp)

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   25
              Male           249506   26
China         Female         249686   25
              Male           257194   25
United States Female         258498   25
              Male           258081   25

7-Merge , Concatinate and Join In Pandas.

In [12]:
# Creating two sample DataFrames
df1 = pd.DataFrame({'Number': [1, 2, 3, 4],
                    'Values': ['a', 'b', 'c', 'd']})
print(df1)

df2 = pd.DataFrame({'Number': [3, 4, 5, 6],
                    'Values': ['x', 'y', 'z', 'w']})

print(df2)

# Merging based on common column 'A'
merged_df = pd.merge(df1, df2, on='Number')

print(merged_df)

   Number Values
0       1      a
1       2      b
2       3      c
3       4      d
   Number Values
0       3      x
1       4      y
2       5      z
3       6      w
   Number Values_x Values_y
0       3        c        x
1       4        d        y

In [13]:
merged_df = pd.merge(df1, df2, on='Number', how='left')
print(merged_df)

   Number Values_x Values_y
0       1        a      NaN
1       2        b      NaN
2       3        c        x
3       4        d        y

In [14]:
merged_df = pd.merge(df1, df2, on='Number', how='right')
print(merged_df)

   Number Values_x Values_y
0       3        c        x
1       4        d        y
2       5      NaN        z
3       6      NaN        w

7.2: Join Data

In [17]:
# Joining based on index (common column 'A')
joined_df = df1.join(df2, lsuffix='_df1', rsuffix='_df2')
print(joined_df)

   Number_df1 Values_df1  Number_df2 Values_df2
0           1          a           3          x
1           2          b           4          y
2           3          c           5          z
3           4          d           6          w

7.3:Concatinate data

In [18]:
# Creating a sample DataFrame
df = pd.DataFrame({'A': [1, 2, 3],
                   'B': ['a', 'b', 'c']})

# Concatenating columns 'A' and 'B' using the concat function
concatenated_column = pd.concat([df['A'].astype(str), df['B']], axis=1)

print(concatenated_column)

   A  B
0  1  a
1  2  b
2  3  c

8- Compare DataFrame in Pandas.

df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': ['a', 'b', 'c']})

df2 = pd.DataFrame({'A': [1, 2, 4],
                    'B': ['a', 'b', 'd']})

comparison = df1 == df2
print(comparison)

In [20]:
df = pd.DataFrame({'A': [1, 2, 3],
                   'B': ['a', 'b', 'c']})

# Comparing column 'A' with a specific value
comparison = df['A'] == 2
print(comparison)

# Comparing row with index 0 with another row
row_comparison = df.iloc[0] == df.iloc[1]
print(row_comparison)

0    False
1     True
2    False
Name: A, dtype: bool
A    False
B    False
dtype: bool

In [21]:
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': ['a', 'b', 'c']})

df2 = pd.DataFrame({'A': [1, 2, 3],
                    'B': ['a', 'b', 'c']})

print(df1.equals(df2))

True

9-Pivoting and Melting DataFrame.
pivoting and melting are two common operations used for reshaping data.

Pivoting involves reshaping the data to have a new shape based on the values of a column. 
It is often used to convert long-form data into wide-form data.

In [23]:
# Creating a sample DataFrame
data = {'date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
        'city': ['A', 'B', 'A', 'B'],
        'temperature': [25, 30, 28, 32]}

df = pd.DataFrame(data)

# Pivoting the DataFrame
pivoted_df = df.pivot(index='date', columns='city', values='temperature')

print(pivoted_df)

city         A   B
date
2022-01-01  25  30
2022-01-02  28  32

Melting is the inverse operation of pivoting. It converts wide-form data into long-form data by unpivoting the DataFrame.

In [24]:
# Creating a sample DataFrame
data = {'date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
        'A': [25, 30, 28, 32],
        'B': [27, 31, 29, 33]}

df = pd.DataFrame(data)

# Melting the DataFrame
melted_df = pd.melt(df, id_vars=['date'], var_name='city', value_name='temperature')

print(melted_df)

         date city  temperature
0  2022-01-01    A           25
1  2022-01-01    A           30
2  2022-01-02    A           28
3  2022-01-02    A           32
4  2022-01-01    B           27
5  2022-01-01    B           31
6  2022-01-02    B           29
7  2022-01-02    B           33